ilanBracha/nfc-ptx105r-ra2e3/src/nfc_reader/src/ptx105r/rs_nfc_ptx105r.c
/**
 * rs_nfc_ptx105r.c
 *
 * Implementation for the Renesas PTX105R NFC reader, calling the Renesas
 * PTX NFC SDK (ptxIoTRd_* / ptx_IOT_READER.h) directly instead of going
 * through the RM_NFC_READER_PTX FSP wrapper. Peripheral (SPI/GPIO/Timer)
 * bring-up still uses the ptxPLAT_* /ptxPERIPH_* platform-glue functions
 * that are also used internally by the FSP wrapper, pointed at the
 * FSP-generated peripheral instances in g_nfc_reader_ptx0_cfg.
 *
 * Each function is a direct, non-static entry point declared in
 * rs_nfc_ptx105r.h and called by name from the rest of the RS NFC Card
 * Reader module — no function-pointer vtable indirection.
 *
 * There is no local state-machine (open/idle/discovered/activated) here:
 * we rely on the PTX SDK's own error handling/return codes instead of
 * re-implementing the FSP wrapper's defensive state checks.
 */

#include "rs_nfc_ptx105r.h"
#include "rs_nfc_ptx105r_board.h"
#include <string.h>
#include "FreeRTOS.h"
#include "task.h"
#include "hal_data.h"
/* PTX NFC SDK — used directly instead of the RM_NFC_READER_PTX FSP API.
 * NOTE: We intentionally use the lean ptxNDEF_T3TOP/T4TOP/T5TOP (Type-3/
 * Type-4/Type-5 Tag NDEF Operation) components instead of the generic
 * ptxNDEF dispatcher. The generic ptxNDEF_Open() unconditionally links
 * T2TOP+T3TOP+T4TOP+T5TOP (~13 KB flash) which does not fit this MCU's
 * flash budget. T2T NDEF read/write remains hand-rolled
 * (rs_ndef_read.c/rs_ndef_write.c). */
#include "ptx_IOT_READER.h"
#include "ptxNDEF_T3TOP.h"
#include "ptxNDEF_T4TOP.h"
#include "ptxNDEF_T5TOP.h"
#include "ptxPLAT_GPIO.h"
#include "ptxPLAT_SPI.h"
#include "ptxPLAT_TIMER.h"
#include "ptxPERIPH_APPTIMER.h"

/***********************************************************************************************************************
 * Module-local constants
 **********************************************************************************************************************/
#define PTX105R_ZERO                  (0)
#define PTX105R_SHUTDOWN_TEMP         (223U)
#define PTX105R_TIMEOUT_RAW           (200U) /* Application-timeout for raw-protocol exchanges */

/* Only perform temperature-sensor calibration once per power cycle */
static bool g_start_temp_calibration = true;

/* Tracks whether rs_nfc_ptx_open() succeeded (replaces FSP ctrl->open) */
static bool g_ptx_opened = false;

/***********************************************************************************************************************
 * SDK T4T NDEF component — static allocation (shared TX/RX buffers).
 * Lean alternative to the generic ptxNDEF_t dispatcher (see note above).
 **********************************************************************************************************************/
static ptxNDEF_T4TOP_t  g_t4t_ndef_comp;
static uint8_t          g_ndef_tx_buf[RS_NFC_PTX_TX_BUF_SIZE];
static uint8_t          g_ndef_rx_buf[RS_NFC_PTX_RX_BUF_SIZE];

/***********************************************************************************************************************
 * SDK T3T NDEF component — static allocation. Shares the TX/RX buffers
 * above. NFCID2 and MRTI are extracted from the active card at open time.
 **********************************************************************************************************************/
static ptxNDEF_T3TOP_t  g_t3t_ndef_comp;

/***********************************************************************************************************************
 * SDK T5T NDEF component — static allocation. Shares the TX/RX buffers
 * above; needs a small dedicated work buffer (block-sized scratch area).
 **********************************************************************************************************************/
#define T5T_WORK_BUF_SIZE  32U
static ptxNDEF_T5TOP_t  g_t5t_ndef_comp;
static uint8_t          g_t5t_work_buf[T5T_WORK_BUF_SIZE];

/***********************************************************************************************************************
 * Interrupt-driven wait support
 **********************************************************************************************************************/

static volatile TaskHandle_t g_waiting_task = NULL;

static void ptx105r_irq_wake_cb(external_irq_callback_args_t *p_args)
{
    RS_COMMON_UNUSED(p_args);
    if (NULL != g_waiting_task)
    {
        BaseType_t higher_prio_task_woken = pdFALSE;
        vTaskNotifyGiveFromISR(g_waiting_task, &higher_prio_task_woken);
        portYIELD_FROM_ISR(higher_prio_task_woken);
    }
}

/***********************************************************************************************************************
 * Internal helpers
 **********************************************************************************************************************/

static rs_nfc_card_type_t map_card_type(ptxIoTRd_CardParams_t *card,
                                         ptxIoTRd_CardProtocol_t prot)
{
    if (NULL == card) { return RS_NFC_CARD_TYPE_UNKNOWN; }

    switch (card->TechType)
    {
        case Tech_TypeA:
            switch (prot)
            {
                case Prot_T2T:    return RS_NFC_CARD_TYPE_NFC_TAG_TYPE_2;
                case Prot_ISODEP: return RS_NFC_CARD_TYPE_NFC_TAG_TYPE_4A;
                default:          return RS_NFC_CARD_TYPE_ISO14443A;
            }
        case Tech_TypeB:
            return (Prot_ISODEP == prot) ? RS_NFC_CARD_TYPE_NFC_TAG_TYPE_4B
                                         : RS_NFC_CARD_TYPE_ISO14443B;
        case Tech_TypeF:
            return (Prot_T3T == prot) ? RS_NFC_CARD_TYPE_NFC_TAG_TYPE_3
                                      : RS_NFC_CARD_TYPE_FELICA;
        case Tech_TypeV:
            return (Prot_T5T == prot) ? RS_NFC_CARD_TYPE_NFC_TAG_TYPE_5
                                      : RS_NFC_CARD_TYPE_ISO15693;
        default:
            return RS_NFC_CARD_TYPE_UNKNOWN;
    }
}

static rs_nfc_protocol_t map_protocol(ptxIoTRd_CardProtocol_t prot)
{
    switch (prot)
    {
        case Prot_T2T:       return RS_NFC_PROT_T2T;
        case Prot_T3T:       return RS_NFC_PROT_T3T;
        case Prot_ISODEP:    return RS_NFC_PROT_ISODEP;
        case Prot_NFCDEP:    return RS_NFC_PROT_NFCDEP;
        case Prot_T5T:       return RS_NFC_PROT_T5T;
        case Prot_Extension: return RS_NFC_PROT_EXTENSION;
        default:             return RS_NFC_PROT_UNDEFINED;
    }
}

static ptxIoTRd_CardProtocol_t choose_protocol(ptxIoTRd_CardParams_t *card)
{
    if (NULL == card) { return Prot_Undefined; }

    switch (card->TechType)
    {
        case Tech_TypeA:
            if (0u != (card->TechParams.CardAParams.SEL_RES & 0x40u))
                return Prot_NFCDEP;
            if (0u != (card->TechParams.CardAParams.SEL_RES & 0x20u))
                return Prot_ISODEP;
            return Prot_T2T;
        case Tech_TypeB:
            if (0u != (card->TechParams.CardBParams.SENSB_RES[10] & 0x01u))
                return Prot_ISODEP;
            return Prot_Undefined;
        case Tech_TypeF:
            if ((0x01u == card->TechParams.CardFParams.SENSF_RES[0]) &&
                (0xFEu == card->TechParams.CardFParams.SENSF_RES[1]))
                return Prot_NFCDEP;
            return Prot_T3T;
        case Tech_TypeV:
            return Prot_T5T;
        case Tech_TypeExtension:
            return Prot_Extension;
        default:
            return Prot_Undefined;
    }
}

static void extract_uid(ptxIoTRd_CardParams_t *card, uint8_t *uid, uint8_t *uid_len)
{
    *uid_len = 0;
    if (NULL == card) { return; }

    switch (card->TechType)
    {
        case Tech_TypeA:
        {
            uint8_t len = card->TechParams.CardAParams.NFCID1_LEN;
            if (len > RS_NFC_UID_MAX_BYTES) { len = RS_NFC_UID_MAX_BYTES; }
            (void)memcpy(uid, card->TechParams.CardAParams.NFCID1, len);
            *uid_len = len;
            break;
        }
        case Tech_TypeB:
            (void)memcpy(uid, &card->TechParams.CardBParams.SENSB_RES[1], 4u);
            *uid_len = 4u;
            break;
        case Tech_TypeF:
            (void)memcpy(uid, &card->TechParams.CardFParams.SENSF_RES[2], 8u);
            *uid_len = 8u;
            break;
        case Tech_TypeV:
            for (uint8_t i = 0; i < 8u; i++)
            {
                uid[i] = card->TechParams.CardVParams.UID[7u - i];
            }
            *uid_len = 8u;
            break;
        default:
            break;
    }
}

static rs_status_t ptx105r_discover_status(rs_nfc_disc_status_t *out_status)
{
    if (NULL == out_status) { return RS_ERR_INVALID_CFG; }

    uint8_t raw = 0;
    ptxStatus_t st = ptxIoTRd_Get_Status_Info(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                              StatusType_Discover, &raw);
    if (ptxStatus_Success != st) { return RS_ERR_INTERNAL; }

