ilanBracha/nfc-ptx105r-ra2e3/src/nfc_reader/src/ptx105r/rs_nfc_ptx105r.c
    switch (raw)
    {
        case RF_DISCOVER_STATUS_CARD_ACTIVE:     *out_status = RS_NFC_DISC_CARD_ACTIVE; break;
        case RF_DISCOVER_STATUS_DISCOVER_RUNNING:*out_status = RS_NFC_DISC_RUNNING;     break;
        case RF_DISCOVER_STATUS_DISCOVER_DONE:   *out_status = RS_NFC_DISC_DONE;        break;
        default:                                 *out_status = RS_NFC_DISC_NO_CARD;     break;
    }
    return RS_OK;
}

static rs_status_t ptx105r_system_check(void)
{
    uint8_t state = 0;
    ptxStatus_t st = ptxIoTRd_Get_Status_Info(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                              StatusType_System, &state);
    if (ptxStatus_Success != st) { return RS_ERR_INTERNAL; }
    return (PTX_SYSTEM_STATUS_OK == state) ? RS_OK : RS_ERR_INTERNAL;
}

static ptxIoTRd_CardRegistry_t *g_active_reg = NULL;

/***********************************************************************************************************************
 * PTX SDK function implementations
 **********************************************************************************************************************/

rs_status_t rs_nfc_ptx_open (void)
{
    nfc_reader_ptx_cfg_t const * p_cfg = &g_nfc_reader_ptx0_cfg;

    /* Define IoT Reader parameters (mirrors former RM_NFC_READER_PTX_Open) */
    ptxIoTRd_InitPars_t            init_params;
    ptxIoTRd_TempSense_Params_t    temp_sensor;
    ptxIoTRd_ComInterface_Params_t com_interface;

    memset(&init_params, PTX105R_ZERO, sizeof(init_params));
    memset(&temp_sensor, PTX105R_ZERO, sizeof(temp_sensor));
    memset(&com_interface, PTX105R_ZERO, sizeof(com_interface));

    /* Temperature-sensor calibration is only performed once per power cycle */
    if (true == g_start_temp_calibration)
    {
        temp_sensor.Calibrate = p_cfg->temp_sensor_calibrate;
        temp_sensor.Tambient  = p_cfg->temp_sensor_ambient;
        temp_sensor.Tshutdown = p_cfg->temp_sensor_shutdown;
        g_start_temp_calibration = false;
    }
    else
    {
        temp_sensor.Tshutdown = PTX105R_SHUTDOWN_TEMP;
    }

    init_params.TemperatureSensor = &temp_sensor;
    init_params.ComInterface      = &com_interface;

    /* Bring up the low-level peripherals (SPI, GPIO/IRQ, timers) required
     * by the PTX SDK. These are the same platform-glue calls the FSP
     * wrapper used to make internally. */
    if (ptxStatus_Success != ptxPLAT_GPIO_Open(p_cfg->p_gpio_context, p_cfg->p_irq_context, p_cfg->interrupt_pin))
    {
        return RS_ERR_INTERNAL;
    }
    if (ptxStatus_Success != ptxPLAT_TIMER_Open(p_cfg->p_timer_context))
    {
        return RS_ERR_INTERNAL;
    }
    if (ptxStatus_Success != ptxPERIPH_APPTIMER_Open(p_cfg->p_app_timer))
    {
        return RS_ERR_INTERNAL;
    }
    if (ptxStatus_Success != ptxPLAT_SPI_Open(p_cfg->p_comms_instance_ctrl, p_cfg->p_gpio_context))
    {
        return RS_ERR_INTERNAL;
    }

    /* Initiate the IoT-Reader System (PTX SDK) */
    ptxStatus_t st = ptxIoTRd_Init(p_cfg->iot_reader_context, &init_params);
    if (ptxStatus_Success != st)
    {
        /* Retry once after a Deinit, mirrors the FSP wrapper's recovery path */
        (void)ptxIoTRd_Deinit(p_cfg->iot_reader_context);
        st = ptxIoTRd_Init(p_cfg->iot_reader_context, &init_params);
    }

    if (ptxStatus_Success != st) { return RS_ERR_INTERNAL; }

    g_ptx_opened = true;
    return RS_OK;
}

rs_status_t rs_nfc_ptx_close(void)
{
    g_active_reg = NULL;
    ptxStatus_t st = ptxIoTRd_Deinit(g_nfc_reader_ptx0_cfg.iot_reader_context);
    g_ptx_opened = false;
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

bool rs_nfc_ptx_is_open(void)
{
    return g_ptx_opened;
}

rs_status_t rs_nfc_ptx_configure_discovery(rs_nfc_tech_mask_t tech_mask)
{
    RS_COMMON_UNUSED(tech_mask);
    return RS_OK;
}

rs_status_t rs_nfc_ptx_start_discovery(void)
{
    nfc_reader_ptx_cfg_t const * p_cfg = &g_nfc_reader_ptx0_cfg;

    ptxIoTRd_DiscConfig_t disc_config;
    (void)memset(&disc_config, PTX105R_ZERO, sizeof(disc_config));

    disc_config.PollTypeA            = p_cfg->poll_type_a;
    disc_config.PollTypeB            = p_cfg->poll_type_b;
    disc_config.PollTypeF212         = p_cfg->poll_type_f;
    disc_config.PollTypeV            = p_cfg->poll_type_v;
    disc_config.IdleTime             = p_cfg->idle_time_ms;
    disc_config.PollTypeADeviceLimit = p_cfg->device_limit;
    disc_config.PollTypeBDeviceLimit = p_cfg->device_limit;
    disc_config.PollTypeVDeviceLimit = p_cfg->device_limit;
    disc_config.PollTypeFDeviceLimit = p_cfg->device_limit;
    disc_config.Discover_Mode        = p_cfg->discover_mode;

    if (!(disc_config.PollTypeA || disc_config.PollTypeB ||
          disc_config.PollTypeF212 || disc_config.PollTypeV))
    {
        return RS_ERR_INVALID_CFG;
    }

    ptxStatus_t st = ptxIoTRd_Initiate_Discovery(p_cfg->iot_reader_context, &disc_config);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

rs_status_t rs_nfc_ptx_stop_discovery(void)
{
    ptxStatus_t st = ptxIoTRd_Reader_Deactivation(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                                  PTX_IOTRD_RF_DEACTIVATION_TYPE_IDLE);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

rs_status_t rs_nfc_ptx_wait_for_card(uint32_t timeout_ms, rs_nfc_disc_status_t *out_status)
{
    if (NULL == out_status) { return RS_ERR_INVALID_CFG; }
    *out_status = RS_NFC_DISC_NO_CARD;

    rs_status_t sys = ptx105r_system_check();
    if (RS_OK != sys) { return sys; }

    if (xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED)
    {
        R_BSP_SoftwareDelay(timeout_ms, BSP_DELAY_UNITS_MILLISECONDS);
        return ptx105r_discover_status(out_status);
    }

    TickType_t remaining_ticks = (UINT32_MAX == timeout_ms)
                                  ? portMAX_DELAY
                                  : pdMS_TO_TICKS(timeout_ms);
    TickType_t start_tick      = xTaskGetTickCount();

    g_waiting_task = xTaskGetCurrentTaskHandle();

    (void)g_ext_irq.p_api->callbackSet(g_ext_irq.p_ctrl, ptx105r_irq_wake_cb, NULL, NULL);

    (void)ulTaskNotifyTake(pdTRUE, 0);

