ilanBracha/nfc-ptx105r-ra2e3/src/nfc_reader/src/ptx105r/rs_nfc_ptx105r.c
    rs_status_t st = RS_OK;

    for (;;)
    {
        (void)ulTaskNotifyTake(pdTRUE, remaining_ticks);

        (void)g_ext_irq.p_api->callbackSet(g_ext_irq.p_ctrl, ptxPLAT_GPIO_IsrCallback, NULL, NULL);

        st = ptx105r_discover_status(out_status);
        if (RS_OK != st) { break; }

        if (RS_NFC_DISC_NO_CARD != *out_status)
        {
            break;
        }

        TickType_t elapsed = xTaskGetTickCount() - start_tick;
        if (elapsed >= remaining_ticks) { break; }
        remaining_ticks = pdMS_TO_TICKS(timeout_ms) - elapsed;

        g_waiting_task = xTaskGetCurrentTaskHandle();
        (void)g_ext_irq.p_api->callbackSet(g_ext_irq.p_ctrl, ptx105r_irq_wake_cb, NULL, NULL);
    }

    g_waiting_task = NULL;
    return st;
}

rs_status_t rs_nfc_ptx_activate_card(rs_nfc_ptx_card_info_t *card_info)
{
    if (NULL == card_info) { return RS_ERR_INVALID_CFG; }
    (void)memset(card_info, 0, sizeof(*card_info));

    ptxIoTRd_t *iot_rd = g_nfc_reader_ptx0_cfg.iot_reader_context;

    ptxIoTRd_CardRegistry_t *reg = NULL;
    ptxStatus_t st = ptxIoTRd_Get_Card_Registry(iot_rd, &reg);
    if ((ptxStatus_Success != st) || (NULL == reg)) { return RS_ERR_INTERNAL; }

    g_active_reg = reg;

    if (NULL != reg->ActiveCard)
    {
        card_info->card_type = map_card_type(reg->ActiveCard, reg->ActiveCardProtType);
        card_info->protocol  = map_protocol(reg->ActiveCardProtType);
        extract_uid(reg->ActiveCard, card_info->uid, &card_info->uid_len);
        return RS_OK;
    }

    if (0u == reg->NrCards) { return RS_ERR_NOT_FOUND; }

    ptxIoTRd_CardProtocol_t prot = choose_protocol(&reg->Cards[0]);
    st = ptxIoTRd_Activate_Card(iot_rd, &reg->Cards[0], prot);
    if (ptxStatus_Success != st) { return RS_ERR_INTERNAL; }

    card_info->card_type = map_card_type(reg->ActiveCard, reg->ActiveCardProtType);
    card_info->protocol  = map_protocol(reg->ActiveCardProtType);
    extract_uid(reg->ActiveCard, card_info->uid, &card_info->uid_len);
    return RS_OK;
}

rs_status_t rs_nfc_ptx_get_card_type(rs_nfc_card_type_t *out_type)
{
    if (NULL == out_type) { return RS_ERR_INVALID_CFG; }

    if (NULL == g_active_reg || NULL == g_active_reg->ActiveCard)
    {
        *out_type = RS_NFC_CARD_TYPE_UNKNOWN;
        return RS_ERR_NOT_FOUND;
    }

    *out_type = map_card_type(g_active_reg->ActiveCard, g_active_reg->ActiveCardProtType);
    return RS_OK;
}

rs_status_t rs_nfc_ptx_get_uid(uint8_t *uid, uint8_t *uid_len)
{
    if ((NULL == uid) || (NULL == uid_len)) { return RS_ERR_INVALID_CFG; }

    if (NULL == g_active_reg || NULL == g_active_reg->ActiveCard)
    {
        *uid_len = 0;
        return RS_ERR_NOT_FOUND;
    }

    extract_uid(g_active_reg->ActiveCard, uid, uid_len);
    return RS_OK;
}

void rs_nfc_ptx_sleep(uint32_t ms)
{
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED)
    {
        vTaskDelay(pdMS_TO_TICKS(ms));
    }
    else
    {
        R_BSP_SoftwareDelay(ms, BSP_DELAY_UNITS_MILLISECONDS);
    }
}

rs_status_t rs_nfc_ptx_data_exchange(const uint8_t *tx, uint32_t tx_len,
                                       uint8_t *rx, uint32_t *rx_len)
{
    if ((NULL == tx) || (NULL == rx) || (NULL == rx_len)) { return RS_ERR_INVALID_CFG; }

    ptxStatus_t st = ptxIoTRd_Data_Exchange(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                            (uint8_t *)(uintptr_t)tx, tx_len,
                                            rx, rx_len, PTX105R_TIMEOUT_RAW);

    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

rs_status_t rs_nfc_ptx_deactivate(void)
{
    ptxStatus_t st = ptxIoTRd_Reader_Deactivation(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                                  PTX_IOTRD_RF_DEACTIVATION_TYPE_DISCOVER);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

rs_status_t rs_nfc_ptx_get_system_state(uint8_t *out_state)
{
    if (NULL == out_state) { return RS_ERR_INVALID_CFG; }
    ptxStatus_t st = ptxIoTRd_Get_Status_Info(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                              StatusType_System, out_state);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

rs_status_t rs_nfc_ptx_get_last_rf_error(uint8_t *out_err)
{
    if (NULL == out_err) { return RS_ERR_INVALID_CFG; }
    ptxStatus_t st = ptxIoTRd_Get_Status_Info(g_nfc_reader_ptx0_cfg.iot_reader_context,
                                              StatusType_LastRFError, out_err);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

void rs_nfc_ptx_wake_waiting_task(void)
{
    TaskHandle_t task = g_waiting_task;
    if (NULL != task)
    {
        (void)xTaskNotifyGive(task);
    }
}

/***********************************************************************************************************************
 * SDK T4T NDEF component lifecycle (lean — see include-block note above)
 *
 * Call rs_nfc_ptx_ndef_open() once per card activation (protocol ==
 * RS_NFC_PROT_ISODEP), and rs_nfc_ptx_ndef_close() after NDEF
 * operations are finished.
 **********************************************************************************************************************/

rs_status_t rs_nfc_ptx_ndef_open(void)
{
    ptxNDEF_T4TOP_InitParams_t params;
    (void)memset(&params, 0, sizeof(params));

    params.RxBuffer                  = g_ndef_rx_buf;
    params.RxBufferSize              = sizeof(g_ndef_rx_buf);
    params.T4TInitParams.IotRd       = g_nfc_reader_ptx0_cfg.iot_reader_context;
    params.T4TInitParams.TxBuffer    = g_ndef_tx_buf;
    params.T4TInitParams.TxBufferSize = sizeof(g_ndef_tx_buf);

    ptxStatus_t st = ptxNDEF_T4TOpOpen(&g_t4t_ndef_comp, &params);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

void rs_nfc_ptx_ndef_close(void)
{
    (void)ptxNDEF_T4TOpClose(&g_t4t_ndef_comp);
}

ptxNDEF_T4TOP_t * rs_nfc_ptx_get_ndef_comp(void)
{
    return &g_t4t_ndef_comp;
}

/***********************************************************************************************************************
 * SDK T5T NDEF component lifecycle (lean — see include-block note above)
 *
 * Call rs_nfc_ptx_ndef_t5t_open() once per card activation (protocol ==
 * RS_NFC_PROT_T5T), and rs_nfc_ptx_ndef_t5t_close() after NDEF
 * operations are finished.
 **********************************************************************************************************************/

rs_status_t rs_nfc_ptx_ndef_t5t_open(void)
{
    ptxNDEF_T5TOP_InitParams_t params;
    (void)memset(&params, 0, sizeof(params));

    params.RxBuffer                   = g_ndef_rx_buf;
    params.RxBufferSize               = sizeof(g_ndef_rx_buf);
    params.WorkBuffer                 = g_t5t_work_buf;
    params.WorkBufferSize             = sizeof(g_t5t_work_buf);
    params.T5TInitParams.IotRd        = g_nfc_reader_ptx0_cfg.iot_reader_context;
    params.T5TInitParams.TxBuffer     = g_ndef_tx_buf;
    params.T5TInitParams.TxBufferSize = sizeof(g_ndef_tx_buf);

    /* Non-addressed mode: correct for the common single-tag-in-field
     * scenario. (Multi-tag V-type addressing would need the active card's
     * UID here — omitted to save flash on this tight-budget MCU.) */

    ptxStatus_t st = ptxNDEF_T5TOpOpen(&g_t5t_ndef_comp, &params);
    return (ptxStatus_Success == st) ? RS_OK : RS_ERR_INTERNAL;
}

void rs_nfc_ptx_ndef_t5t_close(void)
{
    (void)ptxNDEF_T5TOpClose(&g_t5t_ndef_comp);
}

ptxNDEF_T5TOP_t * rs_nfc_ptx_get_ndef_t5t_comp(void)
{
    return &g_t5t_ndef_comp;
}

